app/controllers/sales_controller.rb

  def index
    @sales = Sale.all.page(params[:page]).per(5)
---
SELECT  "sales".* FROM "sales" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "sales"

  def update
    if @sale.update(params_sale)
---
UPDATE "sales" SET "price" = ?, "supplier" = ?, "updated_at" = ? WHERE "sales"."id" = ?  [["price", 500.0], ["supplier", "Sneaker Store Emporium"], ["updated_at", "2018-01-12 16:37:12.461829"], ["id", 11]]

  def create
    @sale = Sale.new(params_sale)

    if @sale.save
---
INSERT INTO "sales" ("buyer", "description", "price", "quantity", "address", "supplier", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    old_sale = @sale

    if @sale.destroy
---
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 8]]

  def set_sale
    @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", 17]]